zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam4eXe-pinctrl.h
/* pb5s_swd_traceswo */
#define PB5S_SWD_TRACESWO \
	SAM_PINMUX(b, 5, s, system)

/* pb6_gpio */
#define PB6_GPIO \
	SAM_PINMUX(b, 6, gpio, gpio)

/* pb6s_jtag_tms */
#define PB6S_JTAG_TMS \
	SAM_PINMUX(b, 6, s, system)

/* pb6s_swd_swdio */
#define PB6S_SWD_SWDIO \
	SAM_PINMUX(b, 6, s, system)

/* pb7_gpio */
#define PB7_GPIO \
	SAM_PINMUX(b, 7, gpio, gpio)

/* pb7s_jtag_tck */
#define PB7S_JTAG_TCK \
	SAM_PINMUX(b, 7, s, system)

/* pb7s_swd_swclk */
#define PB7S_SWD_SWCLK \
	SAM_PINMUX(b, 7, s, system)

/* pb8_gpio */
#define PB8_GPIO \
	SAM_PINMUX(b, 8, gpio, gpio)

/* pb8s_supc_xout */
#define PB8S_SUPC_XOUT \
	SAM_PINMUX(b, 8, s, system)

/* pb9_gpio */
#define PB9_GPIO \
	SAM_PINMUX(b, 9, gpio, gpio)

/* pb9s_supc_xin */
#define PB9S_SUPC_XIN \
	SAM_PINMUX(b, 9, s, system)

/* pb10_gpio */
#define PB10_GPIO \
	SAM_PINMUX(b, 10, gpio, gpio)

/* pb10s_udp_ddm */
#define PB10S_UDP_DDM \
	SAM_PINMUX(b, 10, s, system)

/* pb11_gpio */
#define PB11_GPIO \
	SAM_PINMUX(b, 11, gpio, gpio)

/* pb11s_udp_ddp */
#define PB11S_UDP_DDP \
	SAM_PINMUX(b, 11, s, system)

/* pb12_gpio */
#define PB12_GPIO \
	SAM_PINMUX(b, 12, gpio, gpio)

/* pb12a_pwm_pwml1 */
#define PB12A_PWM_PWML1 \
	SAM_PINMUX(b, 12, a, periph)

/* pb12s_flash_erase */
#define PB12S_FLASH_ERASE \
	SAM_PINMUX(b, 12, s, system)

/* pb13_gpio */
#define PB13_GPIO \
	SAM_PINMUX(b, 13, gpio, gpio)

/* pb13a_pwm_pwml2 */
#define PB13A_PWM_PWML2 \
	SAM_PINMUX(b, 13, a, periph)

/* pb13b_pcm_pck0 */
#define PB13B_PCM_PCK0 \
	SAM_PINMUX(b, 13, b, periph)

/* pb13c_usart0_sck */
#define PB13C_USART0_SCK \
	SAM_PINMUX(b, 13, c, periph)

/* pb13x_dacc_dac0 */
#define PB13X_DACC_DAC0 \
	SAM_PINMUX(b, 13, x, extra)

/* pb14_gpio */
#define PB14_GPIO \
	SAM_PINMUX(b, 14, gpio, gpio)

/* pb14a_spi_npcs1 */
#define PB14A_SPI_NPCS1 \
	SAM_PINMUX(b, 14, a, periph)

/* pb14b_pwm_pwmh3 */
#define PB14B_PWM_PWMH3 \
	SAM_PINMUX(b, 14, b, periph)

/* pb14x_dacc_dac1 */
#define PB14X_DACC_DAC1 \
	SAM_PINMUX(b, 14, x, extra)

/* pc0_gpio */
#define PC0_GPIO \
	SAM_PINMUX(c, 0, gpio, gpio)

/* pc0a_ebi_d0 */
#define PC0A_EBI_D0 \
	SAM_PINMUX(c, 0, a, periph)

/* pc0b_pwm_pwml0 */
#define PC0B_PWM_PWML0 \
	SAM_PINMUX(c, 0, b, periph)

/* pc0x_afec0_ad14 */
#define PC0X_AFEC0_AD14 \
	SAM_PINMUX(c, 0, x, extra)

/* pc1_gpio */
#define PC1_GPIO \
	SAM_PINMUX(c, 1, gpio, gpio)

/* pc1a_ebi_d1 */
#define PC1A_EBI_D1 \
	SAM_PINMUX(c, 1, a, periph)

/* pc1b_pwm_pwml1 */
#define PC1B_PWM_PWML1 \
	SAM_PINMUX(c, 1, b, periph)

/* pc1x_afec1_ad4 */
#define PC1X_AFEC1_AD4 \
	SAM_PINMUX(c, 1, x, extra)

/* pc2_gpio */
#define PC2_GPIO \
	SAM_PINMUX(c, 2, gpio, gpio)

/* pc2a_ebi_d2 */
#define PC2A_EBI_D2 \
	SAM_PINMUX(c, 2, a, periph)

/* pc2b_pwm_pwml2 */
#define PC2B_PWM_PWML2 \
	SAM_PINMUX(c, 2, b, periph)

/* pc2x_afec1_ad5 */
#define PC2X_AFEC1_AD5 \
	SAM_PINMUX(c, 2, x, extra)

/* pc3_gpio */
#define PC3_GPIO \
	SAM_PINMUX(c, 3, gpio, gpio)

/* pc3a_ebi_d3 */
#define PC3A_EBI_D3 \
	SAM_PINMUX(c, 3, a, periph)

/* pc3b_pwm_pwml3 */
#define PC3B_PWM_PWML3 \
	SAM_PINMUX(c, 3, b, periph)

/* pc3x_afec1_ad6 */
#define PC3X_AFEC1_AD6 \
	SAM_PINMUX(c, 3, x, extra)

/* pc4_gpio */
#define PC4_GPIO \
	SAM_PINMUX(c, 4, gpio, gpio)

/* pc4a_ebi_d4 */
#define PC4A_EBI_D4 \
	SAM_PINMUX(c, 4, a, periph)

/* pc4b_spi_npcs1 */
#define PC4B_SPI_NPCS1 \
	SAM_PINMUX(c, 4, b, periph)

/* pc4x_afec1_ad7 */
#define PC4X_AFEC1_AD7 \
	SAM_PINMUX(c, 4, x, extra)

/* pc5_gpio */
#define PC5_GPIO \
	SAM_PINMUX(c, 5, gpio, gpio)

/* pc5a_ebi_d5 */
#define PC5A_EBI_D5 \
	SAM_PINMUX(c, 5, a, periph)

/* pc5b_tc2_tioa6 */
#define PC5B_TC2_TIOA6 \
	SAM_PINMUX(c, 5, b, periph)

/* pc6_gpio */
#define PC6_GPIO \
	SAM_PINMUX(c, 6, gpio, gpio)

/* pc6a_ebi_d6 */
#define PC6A_EBI_D6 \
	SAM_PINMUX(c, 6, a, periph)

/* pc6b_tc2_tiob6 */
#define PC6B_TC2_TIOB6 \
	SAM_PINMUX(c, 6, b, periph)

/* pc7_gpio */
#define PC7_GPIO \
	SAM_PINMUX(c, 7, gpio, gpio)

/* pc7a_ebi_d7 */
#define PC7A_EBI_D7 \
	SAM_PINMUX(c, 7, a, periph)

/* pc7b_tc2_tclk6 */
#define PC7B_TC2_TCLK6 \
	SAM_PINMUX(c, 7, b, periph)

/* pc8_gpio */
#define PC8_GPIO \
	SAM_PINMUX(c, 8, gpio, gpio)

/* pc8a_ebi_nwe */
#define PC8A_EBI_NWE \
	SAM_PINMUX(c, 8, a, periph)

/* pc8b_tc2_tioa7 */
#define PC8B_TC2_TIOA7 \
	SAM_PINMUX(c, 8, b, periph)

/* pc9_gpio */
#define PC9_GPIO \
	SAM_PINMUX(c, 9, gpio, gpio)

/* pc9a_ebi_nandoe */
#define PC9A_EBI_NANDOE \
	SAM_PINMUX(c, 9, a, periph)

/* pc9b_tc2_tiob7 */
#define PC9B_TC2_TIOB7 \
	SAM_PINMUX(c, 9, b, periph)

/* pc10_gpio */
#define PC10_GPIO \
	SAM_PINMUX(c, 10, gpio, gpio)

/* pc10a_ebi_nandwe */
#define PC10A_EBI_NANDWE \
	SAM_PINMUX(c, 10, a, periph)

/* pc10b_tc2_tclk7 */
#define PC10B_TC2_TCLK7 \
	SAM_PINMUX(c, 10, b, periph)

/* pc11_gpio */
#define PC11_GPIO \
	SAM_PINMUX(c, 11, gpio, gpio)

/* pc11a_ebi_nrd */
#define PC11A_EBI_NRD \
	SAM_PINMUX(c, 11, a, periph)

/* pc11b_tc2_tioa8 */
#define PC11B_TC2_TIOA8 \
	SAM_PINMUX(c, 11, b, periph)

/* pc12_gpio */
#define PC12_GPIO \
	SAM_PINMUX(c, 12, gpio, gpio)

/* pc12a_ebi_ncs3 */
#define PC12A_EBI_NCS3 \
	SAM_PINMUX(c, 12, a, periph)

/* pc12b_tc2_tiob8 */
#define PC12B_TC2_TIOB8 \
	SAM_PINMUX(c, 12, b, periph)

/* pc12c_can1_rx */
#define PC12C_CAN1_RX \
	SAM_PINMUX(c, 12, c, periph)

/* pc12x_afec0_ad8 */
#define PC12X_AFEC0_AD8 \
	SAM_PINMUX(c, 12, x, extra)

/* pc13_gpio */
#define PC13_GPIO \
	SAM_PINMUX(c, 13, gpio, gpio)

/* pc13a_ebi_nwait */
#define PC13A_EBI_NWAIT \
	SAM_PINMUX(c, 13, a, periph)

/* pc13b_pwm_pwml0 */
#define PC13B_PWM_PWML0 \
	SAM_PINMUX(c, 13, b, periph)

/* pc13x_afec0_ad6 */
#define PC13X_AFEC0_AD6 \
	SAM_PINMUX(c, 13, x, extra)

/* pc14_gpio */
#define PC14_GPIO \
	SAM_PINMUX(c, 14, gpio, gpio)

/* pc14a_ebi_ncs0 */
#define PC14A_EBI_NCS0 \
	SAM_PINMUX(c, 14, a, periph)

/* pc14b_tc2_tclk8 */
#define PC14B_TC2_TCLK8 \
	SAM_PINMUX(c, 14, b, periph)

/* pc15_gpio */
#define PC15_GPIO \
	SAM_PINMUX(c, 15, gpio, gpio)

/* pc15a_ebi_ncs1 */
#define PC15A_EBI_NCS1 \
	SAM_PINMUX(c, 15, a, periph)

/* pc15b_pwm_pwml1 */
#define PC15B_PWM_PWML1 \
	SAM_PINMUX(c, 15, b, periph)

/* pc15c_can1_tx */
#define PC15C_CAN1_TX \
	SAM_PINMUX(c, 15, c, periph)

