zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam4eXe-pinctrl.h
/* pd17a_gmac_gtxer */
#define PD17A_GMAC_GTXER \
	SAM_PINMUX(d, 17, a, periph)

/* pd18_gpio */
#define PD18_GPIO \
	SAM_PINMUX(d, 18, gpio, gpio)

/* pd18a_ebi_ncs1 */
#define PD18A_EBI_NCS1 \
	SAM_PINMUX(d, 18, a, periph)

/* pd19_gpio */
#define PD19_GPIO \
	SAM_PINMUX(d, 19, gpio, gpio)

/* pd19a_ebi_ncs3 */
#define PD19A_EBI_NCS3 \
	SAM_PINMUX(d, 19, a, periph)

/* pd20_gpio */
#define PD20_GPIO \
	SAM_PINMUX(d, 20, gpio, gpio)

/* pd20a_pwm_pwmh0 */
#define PD20A_PWM_PWMH0 \
	SAM_PINMUX(d, 20, a, periph)

/* pd21_gpio */
#define PD21_GPIO \
	SAM_PINMUX(d, 21, gpio, gpio)

/* pd21a_pwm_pwmh1 */
#define PD21A_PWM_PWMH1 \
	SAM_PINMUX(d, 21, a, periph)

/* pd22_gpio */
#define PD22_GPIO \
	SAM_PINMUX(d, 22, gpio, gpio)

/* pd22a_pwm_pwmh2 */
#define PD22A_PWM_PWMH2 \
	SAM_PINMUX(d, 22, a, periph)

/* pd23_gpio */
#define PD23_GPIO \
	SAM_PINMUX(d, 23, gpio, gpio)

/* pd23a_pwm_pwmh3 */
#define PD23A_PWM_PWMH3 \
	SAM_PINMUX(d, 23, a, periph)

/* pd24_gpio */
#define PD24_GPIO \
	SAM_PINMUX(d, 24, gpio, gpio)

/* pd24a_pwm_pwml0 */
#define PD24A_PWM_PWML0 \
	SAM_PINMUX(d, 24, a, periph)

/* pd25_gpio */
#define PD25_GPIO \
	SAM_PINMUX(d, 25, gpio, gpio)

/* pd25a_pwm_pwml1 */
#define PD25A_PWM_PWML1 \
	SAM_PINMUX(d, 25, a, periph)

/* pd26_gpio */
#define PD26_GPIO \
	SAM_PINMUX(d, 26, gpio, gpio)

/* pd26a_pwm_pwml2 */
#define PD26A_PWM_PWML2 \
	SAM_PINMUX(d, 26, a, periph)

/* pd27_gpio */
#define PD27_GPIO \
	SAM_PINMUX(d, 27, gpio, gpio)

/* pd27a_pwm_pwml3 */
#define PD27A_PWM_PWML3 \
	SAM_PINMUX(d, 27, a, periph)

/* pd28_gpio */
#define PD28_GPIO \
	SAM_PINMUX(d, 28, gpio, gpio)

/* pd29_gpio */
#define PD29_GPIO \
	SAM_PINMUX(d, 29, gpio, gpio)

/* pd30_gpio */
#define PD30_GPIO \
	SAM_PINMUX(d, 30, gpio, gpio)

/* pd31_gpio */
#define PD31_GPIO \
	SAM_PINMUX(d, 31, gpio, gpio)

/* pe0_gpio */
#define PE0_GPIO \
	SAM_PINMUX(e, 0, gpio, gpio)

/* pe1_gpio */
#define PE1_GPIO \
	SAM_PINMUX(e, 1, gpio, gpio)

/* pe2_gpio */
#define PE2_GPIO \
	SAM_PINMUX(e, 2, gpio, gpio)

/* pe3_gpio */
#define PE3_GPIO \
	SAM_PINMUX(e, 3, gpio, gpio)

/* pe4_gpio */
#define PE4_GPIO \
	SAM_PINMUX(e, 4, gpio, gpio)

/* pe5_gpio */
#define PE5_GPIO \
	SAM_PINMUX(e, 5, gpio, gpio)
